# Aula 03 - Tabelas e Tipos de Dados

## Introdução

Neste notebook vamos explorar um pouco de dados tabulares. A principal biblioteca para leitura de dados tabulares em Python se chama **pandas**. A mesma é bastante poderosa implementando uma série de operações de bancos de dados (e.g., groupby e join). Nossa discussão será focada em algumas das funções principais do pandas que vamos explorar no curso. Existe uma série ampla de funcionalidades que a biblioteca (além de outras) vai trazer. Caso necessite de algo além da aula, busque na documentação da biblioteca. Por fim, durante esta aula, também vamos aprender um pouco de bash.

## Objetivos

1. Aprender Pandas
2. Entender diferentes tipos de dados
3. Básico de filtros e seleções

## Resultado Esperado

1. Aplicação de filtros básicos para gerar insights nos dados de dados tabulares

## Imports básicos

A maioria dos nossos notebooks vai iniciar com os imports abaixo.
1. pandas: dados tabulates
1. matplotlib: gráficos e plots

A chamada `plt.ion` habilita gráficos do matplotlib no notebook diretamente. Caso necesse salvar alguma figura, chame `plt.savefig` após seu plot.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

plt.ion()

## Series

Existem dois tipos base de dados em pandas. O primeiro, Series, representa uma coluna de dados. Um combinação de Series vira um DataFrame (mais abaixo). Diferente de um vetor `numpy`, a Series de panda captura uma coluna de dados (ou vetor) indexado. Isto é, podemos nomear cada um dos valores.

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])

In [3]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

Note que podemos usar como um vetor

In [4]:
data[0]

0.25

Porém o índice nos ajuda. Para um exemplo trivial como este não será tão interessante, mas vamos usar o mesmo.

In [5]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

Com .loc acessamos uma linha do índice com base no nome. Então:

1. `series.loc[objeto_python]` - valor com o devido nome.
1. `series.iloc[int]` - i-ésimo elemento da Series.

In [6]:
data.loc['a']

0.25

In [7]:
data.loc['b']

0.5

Com `iloc` acessamos por número da linha, estilho um vetor.

In [5]:
data.iloc[0]

0.25

In [6]:
data[0]

0.25

## Data Frames

Ao combinar várias Series com um índice comum, criamos um **DataFrame**. Não é tão comum gerar os mesmos na mão como estamos fazendo, geralmente carregamos DataFrames de arquivos `.csv`, `.json` ou até de sistemas de bancos de dados `mariadb`. De qualquer forma, use os exemplos abaixo para entender a estrutura de um dataframe.

Lembre-se que {}/dict é um dicionário (ou mapa) em Python. Podemos criar uma série a partir de um dicionário
index->value

In [7]:
area_dict = {'California': 423967,
             'Texas': 695662,
             'New York': 141297,
             'Florida': 170312,
             'Illinois': 149995}

A linha abaixo pega todas as chaves.

In [8]:
list(area_dict.keys())

['California', 'Texas', 'New York', 'Florida', 'Illinois']

Agora todas as colunas

In [9]:
list(area_dict.values())

[423967, 695662, 141297, 170312, 149995]

Acessando um valor.

In [10]:
area_dict['California']

423967

Podemos criar a série a partir do dicionário, cada chave vira um elemento do índice. Os valores viram os dados do vetor.

In [14]:
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

Agora, vamos criar outro dicionário com a população dos estados.

In [15]:
pop_dict = {'California': 38332521,
            'Texas': 26448193,
            'New York': 19651127,
            'Florida': 19552860,
            'Illinois': 12882135}
pop = pd.Series(pop_dict)
pop

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

Por fim, observe que o DataFrame é uma combinação de Series. Cada uma das Series vira uma coluna da tabela de dados.

In [16]:
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

Agora o use de `.loc e .iloc` deve ficar mais claro, observe os exemplos abaixo.

In [17]:
data.loc['California']

area      423967
pop     38332521
Name: California, dtype: int64

In [17]:
data.loc[['California', 'Texas']]

              area       pop
California  423967  38332521
Texas       695662  26448193

Note que o uso de `iloc` retorna a i-ésima linha. O problema é que nem sempre nos dataframes esta ordem vai fazer sentido. O `iloc` acaba sendo mais interessante para iteração (e.g., passar por todas as linhas.)

In [18]:
data.iloc[0]

area      423967
pop     38332521
Name: California, dtype: int64

## Slicing

Agora, podemos realizar slicing no DataFrame. Slicing é uma operação Python que retorna sub-listas/sub-vetores. Caso não conheça, tente executar o exemplo abaixo:

```python
l = []
l = [7, 1, 3, 5, 9]
print(l[0])
print(l[1])
print(l[2])

# Agora, l[bg:ed] retorna uma sublista iniciando em bg e terminando em ed-1
print(l[1:4])
```

In [19]:
l = []
l = [7, 1, 3, 5, 9]
print(l[0])
print(l[1])
print(l[2])

# Agora, l[bg:ed] retorna uma sublista iniciando em bg e terminando em ed-1
print(l[1:4])

7
1
3
[1, 3, 5]

Voltando para o nosso **dataframe**, podemos realizar o slicing usando o `.iloc`.

In [20]:
data.iloc[2:4]

            area       pop
New York  141297  19651127
Florida   170312  19552860

## Modificando DataFrames

Series e DataFrames são objetos mutáveis em Python. Podemos adicionar novas colunas em DataFrama facilmente da mesma forma que adicionamos novos valores em um mapa. Por fim, podemos também mudar o valor de linhas específicas e adicionar novas linhas.

In [19]:
data['density'] = data['pop'] / data['area']
data.loc['Texas']

area       6.956620e+05
pop        2.644819e+07
density    3.801874e+01
Name: Texas, dtype: float64

In [22]:
df = data

In [23]:
df.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

## Arquivos

Antes de explorar DataFrames em arquivos, vamos ver como um notebook na é um shell bastante poderoso. Ao usar uma exclamação (!) no notebook Jupyter, conseguimos executar comandos do shell do sistema. Em particular, aqui estamos executando o comando ls para indentificar os dados da pasta atual.

Tudo que executamos com `!` é um comando do terminal do unix. Então, este notebook só deve executar as linhas abaixo em um `Mac` ou `Linux`.

In [24]:
!ls .

Aula03-Tabelas.ipynb                  movie_metadata.csv_movie_metadata.csv
baby.csv                              nba_salaries.csv

Com a opção -lha, mostramos meta-dados dos arquivos como o owner, tamanho e permissões. Note que todos os arquivos são .csv, isto é comma separated.

In [25]:
!ls -lha .

total 305280
drwxr-xr-x   7 flaviovdf  staff   224B Mar 24 11:20 .
drwxr-xr-x  10 flaviovdf  staff   320B Mar 24 10:29 ..
drwxr-xr-x   3 flaviovdf  staff    96B Mar 10 15:21 .ipynb_checkpoints
-rw-r--r--   1 flaviovdf  staff    86K Mar 24 11:20 Aula03-Tabelas.ipynb
-rw-r--r--   1 flaviovdf  staff   148M Mar 13 04:56 baby.csv
-rw-r--r--   1 flaviovdf  staff   1.4M Mar 13 04:55 movie_metadata.csv_movie_metadata.csv
-rw-r--r--   1 flaviovdf  staff    18K Mar 13 04:55 nba_salaries.csv

Vamos identificar qual a cara de um csv. O programa `head` imprime as primeiras `n` linhas de um arquivo.

In [26]:
!head baby.csv

Id,Name,Year,Gender,State,Count
1,Mary,1910,F,AK,14
2,Annie,1910,F,AK,12
3,Anna,1910,F,AK,10
4,Margaret,1910,F,AK,8
5,Helen,1910,F,AK,7
6,Elsie,1910,F,AK,6
7,Lucy,1910,F,AK,6
8,Dorothy,1910,F,AK,5
9,Mary,1911,F,AK,12

## Baby Names

É bem mais comum fazer uso de DataFrames que já existem em arquivos. Note que o trabalho do cientista de dados nem sempre vai ter tais arquivos prontos. Em várias ocasiões, você vai ter que coletar e organizar os mesmos. Limpeza e coleta de dados é uma parte fundamental do seu trabalho. Durante a matéria, boa parte dos notebooks já vão ter dados prontos.

In [20]:
df = pd.read_csv('baby.csv', index_col=0)
df

/Users/flaviov/anaconda3/lib/python3.6/site-packages/numpy/lib/arraysetops.py:463: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

              Name  Year Gender State  Count
Id
1             Mary  1910      F    AK     14
2            Annie  1910      F    AK     12
3             Anna  1910      F    AK     10
4         Margaret  1910      F    AK      8
5            Helen  1910      F    AK      7
6            Elsie  1910      F    AK      6
7             Lucy  1910      F    AK      6
8          Dorothy  1910      F    AK      5
9             Mary  1911      F    AK     12
10        Margaret  1911      F    AK      7
11            Ruth  1911      F    AK      7
12           Annie  1911      F    AK      6
13       Elizabeth  1911      F    AK      6
14           Helen  1911      F    AK      6
15            Mary  1912      F    AK      9
16           Elsie  1912      F    AK      8
17           Agnes  1912      F    AK      7
18            Anna  1912      F    AK      7
19           Helen  1912      F    AK      7
20          Louise  1912      F    AK      7
21            Jean  1912      F    AK      6
22            Ruth  1912      F    AK      6
23           Alice  1912      F    AK      5
24          Esther  1912      F    AK      5
25           Ethel  1912      F    AK      5
26        Margaret  1912      F    AK      5
27           Marie  1912      F    AK      5
28            Mary  1913      F    AK     21
29       Elizabeth  1913      F    AK      9
30        Margaret  1913      F    AK      8
...            ...   ...    ...   ...    ...
5647397     Brooks  2014      M    WY      5
5647398     Calvin  2014      M    WY      5
5647399    Cameron  2014      M    WY      5
5647400     Dalton  2014      M    WY      5
5647401     Dawson  2014      M    WY      5
5647402     Edward  2014      M    WY      5
5647403      Elias  2014      M    WY      5
5647404       Gage  2014      M    WY      5
5647405     Hayden  2014      M    WY      5
5647406     Jasper  2014      M    WY      5
5647407       Jose  2014      M    WY      5
5647408     Kaiden  2014      M    WY      5
5647409      Kaleb  2014      M    WY      5
5647410      Kasen  2014      M    WY      5
5647411      Kyson  2014      M    WY      5
5647412      Lukas  2014      M    WY      5
5647413      Myles  2014      M    WY      5
5647414  Nathaniel  2014      M    WY      5
5647415      Nolan  2014      M    WY      5
5647416     Oakley  2014      M    WY      5
5647417       Odin  2014      M    WY      5
5647418     Paxton  2014      M    WY      5
5647419    Raymond  2014      M    WY      5
5647420    Richard  2014      M    WY      5
5647421      Rowan  2014      M    WY      5
5647422       Seth  2014      M    WY      5
5647423    Spencer  2014      M    WY      5
5647424       Tyce  2014      M    WY      5
5647425     Victor  2014      M    WY      5
5647426     Waylon  2014      M    WY      5

[5647426 rows x 5 columns]

O método `head` do notebook retorna as primeiras `n` linhas do mesmo. Use tal método para entender seus dados. **Sempre olhe para seus dados.** Note como as linhas abaixo usa o `loc` e `iloc` para entender um pouco a estrutura dos mesmos.

In [21]:
df.head(6)

        Name  Year Gender State  Count
Id
1       Mary  1910      F    AK     14
2      Annie  1910      F    AK     12
3       Anna  1910      F    AK     10
4   Margaret  1910      F    AK      8
5      Helen  1910      F    AK      7
6      Elsie  1910      F    AK      6

In [22]:
df[10:15]

         Name  Year Gender State  Count
Id
11       Ruth  1911      F    AK      7
12      Annie  1911      F    AK      6
13  Elizabeth  1911      F    AK      6
14      Helen  1911      F    AK      6
15       Mary  1912      F    AK      9

In [30]:
df.iloc[0:6]

        Name  Year Gender State  Count
Id
1       Mary  1910      F    AK     14
2      Annie  1910      F    AK     12
3       Anna  1910      F    AK     10
4   Margaret  1910      F    AK      8
5      Helen  1910      F    AK      7
6      Elsie  1910      F    AK      6

In [23]:
df[['Name', 'Gender']].head(6)

        Name Gender
Id
1       Mary      F
2      Annie      F
3       Anna      F
4   Margaret      F
5      Helen      F
6      Elsie      F

## Groupby

Vamos responder algumas perguntas com a função groupby. Lembrando a ideia é separar os dados com base em valores comuns, ou seja, agrupar por nomes e realizar alguma operação. O comando abaixo agrupa todos os recem-náscidos por nome. Imagine a mesma fazendo uma operação equivalente ao laço abaixo:

```python
buckets = {}                    # Mapa de dados
names = set(df['Name'])         # Conjunto de nomes únicos
for idx, row in df.iterrows():  # Para cada linha dos dados
    name = row['Name']
    if name not in buckets:
        buckets[name] = []      # Uma lista para cada nome
    buckets[name].append(row)   # Separa a linha para cada nome
```

O código acima é bastante lento!!! O groupby é optimizado. Com base na linha abaixo, o mesmo nem retorna nehum resultado ainda. Apenas um objeto onde podemos fazer agregações.

In [24]:
gb = df.groupby('Name')
type(gb)

pandas.core.groupby.generic.DataFrameGroupBy

Agora posso agregar todos os nomes com alguma operação. Por exemplo, posso somar a quantidade de vezes que cada nome ocorre. Em python, seria o seguinte código.

```python
sum_ = {}                       # Mapa de dados
for name in buckets:            # Para cada nomee
    sum_[name] = 0
    for row in buckets[name]:   # Para cada linha com aquele nome, aggregate (some)
        sum_[name] += row['Count']
```

Observe o resultado da agregação abaixo. Qual o problema com a coluna `Year`??

In [26]:
gb.mean()

                   Year      Count
Name
Aaban       2013.500000   6.000000
Aadan       2009.750000   5.750000
Aadarsh     2009.000000   5.000000
Aaden       2010.015306  17.479592
Aadhav      2014.000000   6.000000
Aadhya      2012.875000  11.325000
Aadi        2008.794872   8.025641
Aadil       2003.000000   5.000000
Aadin       2008.000000   5.000000
Aadit       2009.666667   6.000000
Aaditya     2008.285714   6.928571
Aadya       2012.638889   8.333333
Aadyn       2010.363636   6.272727
Aahan       2008.000000   7.000000
Aahana      2011.000000   8.266667
Aahil       2009.750000   7.812500
Aahna       2014.000000   7.000000
Aaiden      2011.250000   8.500000
Aaima       2013.000000   5.000000
Aakash      2002.250000   6.568182
Aalaya      2014.000000   5.000000
Aalayah     2011.411765   5.823529
Aaleah      2012.000000   5.000000
Aaleyah     2010.937500   8.343750
Aalia       2012.000000   5.666667
Aaliah      2008.080000   9.480000
Aalijah     2010.000000   5.000000
Aaliya      2008.200000   6.620000
Aaliyah     2004.319876  71.697723
Aaliyha     2006.800000   5.400000
...                 ...        ...
Zyire       2007.000000   5.000000
Zykeria     2005.059701  10.044776
Zykeriah    2008.000000   5.000000
Zykerria    2003.900000   7.100000
Zykia       2002.538462   6.923077
Zykierra    2007.000000   5.000000
Zykira      2006.333333   6.333333
Zykiria     2006.000000   5.500000
Zyla        2011.705882   6.235294
Zylah       2011.800000   6.200000
Zylan       2011.000000   5.500000
Zylen       2013.500000   6.000000
Zyler       2011.071429   6.285714
Zymari      2009.000000   5.000000
Zymarion    2009.666667   5.000000
Zymere      2009.785714   7.500000
Zymier      2010.333333   5.333333
Zymiere     2010.666667   5.000000
Zymir       2009.139535   8.023256
Zymire      2012.000000   5.000000
Zyon        2007.656805   8.230769
Zyonna      2009.818182   5.545455
Zyquan      2005.777778   5.777778
Zyquavious  2010.000000   6.000000
Zyra        2012.142857   6.000000
Zyrah       2012.000000   5.500000
Zyren       2013.000000   6.000000
Zyria       2006.714286   5.785714
Zyriah      2009.666667   6.444444
Zyshonne    1998.000000   5.000000

[30274 rows x 2 columns]

Não faz tanto sentido somar o ano, embora seja um número aqui representa uma categoria. Vamos somar as contagens apenas.

In [29]:
gb.sum()['Count'].sort_values()

Name
Zyshonne             5
Makenlee             5
Makenlie             5
Makinlee             5
Makua                5
Cathaleya            5
Makyia               5
Makynzee             5
Malacai              5
Catello              5
Malai                5
Catcher              5
Malajah              5
Maleeha              5
Maleigh              5
Castin               5
Maleko               5
Malini               5
Malissia             5
Malissie             5
Makaylie             5
Makay                5
Makalynn             5
Makailyn             5
Mahesh               5
Caylynn              5
Caylyn               5
Mahin                5
Mahjabeen            5
Mahreen              5
                ...
Brian          1159034
Joshua         1174451
Edward         1212969
Andrew         1239305
Kenneth        1261928
Steven         1272459
George         1324735
Mark           1341573
Paul           1357785
Anthony        1397105
Donald         1403439
Barbara        1424544
Linda          1448063
Jennifer       1464686
Elizabeth      1502094
Matthew        1551706
Patricia       1569944
Daniel         1857096
Christopher    1997925
Thomas         2219967
Charles        2252146
Joseph         2485220
Richard        2534949
David          3562278
Mary           3740495
William        3839236
Michael        4312975
Robert         4725713
John           4845414
James          4957166
Name: Count, Length: 30274, dtype: int64

E ordenar...

In [35]:
gb.sum()['Count'].sort_values()

Name
Zyshonne             5
Makenlee             5
Makenlie             5
Makinlee             5
Makua                5
Cathaleya            5
Makyia               5
Makynzee             5
Malacai              5
Catello              5
Malai                5
Catcher              5
Malajah              5
Maleeha              5
Maleigh              5
Castin               5
Maleko               5
Malini               5
Malissia             5
Malissie             5
Makaylie             5
Makay                5
Makalynn             5
Makailyn             5
Mahesh               5
Caylynn              5
Caylyn               5
Mahin                5
Mahjabeen            5
Mahreen              5
                ...
Brian          1159034
Joshua         1174451
Edward         1212969
Andrew         1239305
Kenneth        1261928
Steven         1272459
George         1324735
Mark           1341573
Paul           1357785
Anthony        1397105
Donald         1403439
Barbara        1424544
Linda          1448063
Jennifer       1464686
Elizabeth      1502094
Matthew        1551706
Patricia       1569944
Daniel         1857096
Christopher    1997925
Thomas         2219967
Charles        2252146
Joseph         2485220
Richard        2534949
David          3562278
Mary           3740495
William        3839236
Michael        4312975
Robert         4725713
John           4845414
James          4957166
Name: Count, Length: 30274, dtype: int64

É comum, embora mais chato de ler, fazer tudo em uma única chamada. Isto é uma prática que vem do mundo SQL. A chamada abaixo seria o mesmo de:

```sql
SELECT Name, SUM(Count)
FROM baby_table
GROUPBY Name
ORDERBY SUM(Count)
```

In [36]:
df.groupby('Name').sum().sort_values(by='Count')['Count']

Name
Zyshonne             5
Makenlee             5
Makenlie             5
Makinlee             5
Makua                5
Cathaleya            5
Makyia               5
Makynzee             5
Malacai              5
Catello              5
Malai                5
Catcher              5
Malajah              5
Maleeha              5
Maleigh              5
Castin               5
Maleko               5
Malini               5
Malissia             5
Malissie             5
Makaylie             5
Makay                5
Makalynn             5
Makailyn             5
Mahesh               5
Caylynn              5
Caylyn               5
Mahin                5
Mahjabeen            5
Mahreen              5
                ...
Brian          1159034
Joshua         1174451
Edward         1212969
Andrew         1239305
Kenneth        1261928
Steven         1272459
George         1324735
Mark           1341573
Paul           1357785
Anthony        1397105
Donald         1403439
Barbara        1424544
Linda          1448063
Jennifer       1464686
Elizabeth      1502094
Matthew        1551706
Patricia       1569944
Daniel         1857096
Christopher    1997925
Thomas         2219967
Charles        2252146
Joseph         2485220
Richard        2534949
David          3562278
Mary           3740495
William        3839236
Michael        4312975
Robert         4725713
John           4845414
James          4957166
Name: Count, Length: 30274, dtype: int64

Podemos inverter com ::-1

In [30]:
df.groupby(['Name', 'Year']).sum()

                 Count
Name       Year
Aaban      2013      6
           2014      6
Aadan      2008     12
           2009      6
           2014      5
Aadarsh    2009      5
Aaden      2005      5
           2007     98
           2008    939
           2009   1242
           2010    414
           2011    228
           2012    167
           2013    153
           2014    180
Aadhav     2014      6
Aadhya     2007      5
           2009      6
           2011     20
           2012     66
           2013    135
           2014    221
Aadi       2003      6
           2004      8
           2005     25
           2006     43
           2007     33
           2008     45
           2009     45
           2010     27
...                ...
Zyquan     2008     12
           2010      8
Zyquavious 2010      6
Zyra       2008      6
           2011      5
           2012      6
           2013     12
           2014     13
Zyrah      2011      5
           2013      6
Zyren      2013      6
Zyria      1998      6
           2001      5
           2003     11
           2005      6
           2007     11
           2008     20
           2009      6
           2011      5
           2012      6
           2014      5
Zyriah     2006      6
           2007     13
           2008     10
           2009      5
           2011      6
           2012      5
           2013      7
           2014      6
Zyshonne   1998      5

[548154 rows x 1 columns]

## NBA Salaries e Indexação Booleana

Por fim, vamos explorar alguns dados da NBA para entender a indexação booleana. Vamos carregar os dados da mesma forma que carregamos os dados dos nomes de crianças.

In [38]:
df = pd.read_csv('nba_salaries.csv')
df.head()

           PLAYER POSITION           TEAM     SALARY
0    Paul Millsap       PF  Atlanta Hawks  18.671659
1      Al Horford        C  Atlanta Hawks  12.000000
2  Tiago Splitter        C  Atlanta Hawks   9.756250
3     Jeff Teague       PG  Atlanta Hawks   8.000000
4     Kyle Korver       SG  Atlanta Hawks   5.746479

Por fim, vamos indexar nosso DataFrame por booleanos. A linha abaixo pega um vetor de booleanos onde o nome do time é `Houston Rockets`.

In [39]:
df['TEAM'] == 'Houston Rockets'

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
387    False
388    False
389    False
390    False
391    False
392    False
393    False
394    False
395    False
396    False
397    False
398    False
399    False
400    False
401    False
402    False
403    False
404    False
405    False
406    False
407    False
408    False
409    False
410    False
411    False
412    False
413    False
414    False
415    False
416    False
Name: TEAM, Length: 417, dtype: bool

Podemos usar tal vetor para filtrar nosso DataFrame. A linha abaixo é o mesmo de um:

```sql
SELECT *
FROM table
WHERE TEAM = 'Houston Rockets'
```

In [40]:
filtro = df['TEAM'] == 'Houston Rockets'
df[filtro]

                 PLAYER POSITION             TEAM     SALARY
131       Dwight Howard        C  Houston Rockets  22.359364
132        James Harden       SG  Houston Rockets  15.756438
133           Ty Lawson       PG  Houston Rockets  12.404495
134        Corey Brewer       SG  Houston Rockets   8.229375
135        Trevor Ariza       SF  Houston Rockets   8.193030
136    Patrick Beverley       PG  Houston Rockets   6.486486
137      K.J. McDaniels       SG  Houston Rockets   3.189794
138      Terrence Jones       PF  Houston Rockets   2.489530
139  Donatas Motiejunas       PF  Houston Rockets   2.288205
140          Sam Dekker       SF  Houston Rockets   1.646400
141        Clint Capela       PF  Houston Rockets   1.242720
142    Montrezl Harrell       PF  Houston Rockets   1.000000

Assim como pegar os salários maior do que um certo valor!

In [41]:
df[df['SALARY'] > 20]

              PLAYER POSITION                   TEAM     SALARY
29       Joe Johnson       SF          Brooklyn Nets  24.894863
60      Derrick Rose       PG          Chicago Bulls  20.093064
72      LeBron James       SF    Cleveland Cavaliers  22.970500
131    Dwight Howard        C        Houston Rockets  22.359364
156       Chris Paul       PG   Los Angeles Clippers  21.468695
169      Kobe Bryant       SF     Los Angeles Lakers  25.000000
201       Chris Bosh       PF             Miami Heat  22.192730
255  Carmelo Anthony       SF        New York Knicks  22.875000
268     Kevin Durant       SF  Oklahoma City Thunder  20.158622

## Exercícios

Abaixo temos algumas chamadas em pandas. Tente explicar cada uma delas.

In [42]:
df[['POSITION', 'SALARY']].groupby('POSITION').mean()

            SALARY
POSITION
C         6.082913
PF        4.951344
PG        5.165487
SF        5.532675
SG        3.988195

In [43]:
df[['TEAM', 'SALARY']].groupby('TEAM').mean().sort_values('SALARY')

                           SALARY
TEAM
Phoenix Suns             2.971813
Utah Jazz                3.095993
Portland Trail Blazers   3.246206
Philadelphia 76ers       3.267796
Boston Celtics           3.352367
Milwaukee Bucks          4.019873
Detroit Pistons          4.221176
Toronto Raptors          4.392507
Brooklyn Nets            4.408229
Denver Nuggets           4.459243
Memphis Grizzlies        4.466497
Charlotte Hornets        4.672355
Indiana Pacers           4.822694
Atlanta Hawks            4.969507
New Orleans Pelicans     5.032163
Minnesota Timberwolves   5.065186
Los Angeles Clippers     5.082624
Washington Wizards       5.296912
New York Knicks          5.338846
Orlando Magic            5.544567
Dallas Mavericks         5.978414
Oklahoma City Thunder    6.052010
Sacramento Kings         6.216808
Los Angeles Lakers       6.237086
San Antonio Spurs        6.511698
Chicago Bulls            6.568407
Golden State Warriors    6.720367
Miami Heat               6.794056
Houston Rockets          7.107153
Cleveland Cavaliers     10.231241

## Para exploração futura

* Veja a documentação do pandas. https://pandas.pydata.org/
* O livro do Jake Vanderplas explora várias funções pandas. https://jakevdp.github.io/PythonDataScienceHandbook/